# ==================================================
# メッセージID
# ==================================================

class _Const:
    class ConstError(TypeError):
        pass
    
    # メッセージID
    E0000000 = 'E0000000'
    E0000001 = 'E0000001'
    E0000002 = 'E0000002'
    E0000003 = 'E0000003'
    E0000004 = 'E0000004'
    E0000005 = 'E0000005'
    E0000006 = 'E0000006'
    E0000007 = 'E0000007'
    E0000008 = 'E0000008'
    E0000009 = 'E0000009'
    I0000000 = 'I0000000'
    W0000000 = 'W0000000'
    
    # 新規定数の追加・変更を禁止
    def __setattr__(self, name, value):
        raise self.ConstError('定数の追加・変更はできません (%s)' % name)

import sys
sys.modules[__name__] = _Const()
