# ==================================================
# 動画変換ツールで使用する列挙型
# ==================================================

from enum import Enum

# ==================================================
# 動画変換モードEnum
# ==================================================
class ConverterModeEnum(Enum):
    TRIM = 1
    IMAGE = 2



# ==================================================
# 動画変換コーデックタイプ組み合わせEnum
# ==================================================
class MultimediaTypeEnum(Enum):
    VIDEO_AND_AUDIO = 1
    ONLY_VIDEO = 2
    ONLY_AUDIO = 3

